{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# <font color=\"35e8b2\">Python</font>\n",
    "# <font color=\"35e8b2\">Условия и циклы</font>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## <font color=\"ba922d\">Тема 1: Булевы значения</font>\n",
    "\n",
    "## Объяснение:\n",
    "Булев тип (или логический тип) - это тип данных, который может принимать одно из двух возможных значений: True (истина) или False (ложь). В Python булевы значения используются для оценки условий и управления потоком выполнения программы.\n",
    "\n",
    "## <font color=\"e85f35\">Шаблон на русском:</font>\n",
    "<font color=\"46e887\"><pre>\n",
    "переменная = True\n",
    "переменная = False</pre>\n",
    "</font>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## <font color=\"ba922d\">Тема 2: Условия</font>\n",
    "\n",
    "## Объяснение:\n",
    "\n",
    "Условия в программировании позволяют выполнять определенный блок кода только в том случае, если определенное условие истинно.\n",
    "\n",
    "## <font color=\"e85f35\">Шаблон на русском:</font>\n",
    "\n",
    "<pre><font color=\"46e887\">если условие:\n",
    "    выполнить действие\n",
    "\n",
    "если другое условие:\n",
    "    выполнить другое действие\n",
    "    \n",
    "иначе:\n",
    "    выполнить третье действие</font></pre>\n",
    "\n",
    "\n",
    "## <font color=\"46d5e8\">Пример на Python:</font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x = int(input(\"Введите число\"))\n",
    "if x > 30:\n",
    "    print(\"Число больше 30\")\n",
    "elif x > 20:\n",
    "    print(\"Число больше 20\")\n",
    "elif x > 5:\n",
    "    print(\"Число больше 5\")\n",
    "else:\n",
    "    print(\"Число меньше 30\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "is_raining = True\n",
    "is_sunny = False\n",
    "if is_raining:\n",
    "    print(\"Прихватите зонтик!\")\n",
    "\n",
    "if not is_sunny:\n",
    "    print(\"Наденьте пальто!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задания для закрепления материала:\n",
    "1. Напишите программу, которая будет проверять, является ли число четным или нечетным.\n",
    "2. Создайте переменную is_student и присвойте ей значение True, если возраст человека в промежутке от 18 до 22 или False, в обратном случае.\n",
    "3. Напишите программу, которая будет определять, можно ли введенное пользователем число поделить на 3 без остатка.\n",
    "4. Напишите программу, которая будет сравнивать два числа и выводить на экран сообщение о том, какое из них больше.\n",
    "5. Напишите программу, которая проверяет, является ли введенное пользователем число положительным или отрицательным."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## <font color=\"ba922d\">Тема 3: Циклы for</font>\n",
    "\n",
    "## Объяснение:\n",
    "Циклы for позволяют выполнять определенный блок кода для каждого элемента в последовательности (например, в списке).\n",
    "\n",
    "## <font color=\"e85f35\">Шаблон на русском:</font>\n",
    "<pre>\n",
    "<font color=\"46e887\">for элемент in список:\n",
    "    выполнить действие с элементом</pre></font>\n",
    "<pre>\n",
    "<font color=\"46e887\">for элемент in промежуток(старт, конец, шаг):\n",
    "    выполнить действие с элементом</pre></font>\n",
    "\n",
    "## <font color=\"46d5e8\">Пример на Python:</font>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "fruits = 'ABCDEF'\n",
    "for fruit in fruits:\n",
    "    print(fruit)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "for n in range():\n",
    "    print(n**2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " ## Задания для закрепления материала:\n",
    "1. Напишите программу, которая будет выводить на экран все числа от 1 до 10.\n",
    "2. Напишите программу, которая будет находить сумму всех чисел от 1 до 10.\n",
    "4. Напишите программу, которая будет выводить на экран таблицу умножения на 5 (от 1 до 10).\n",
    "5. Напишите программу, которая будет находить сумму всех четных чисел от 1 до 20."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## <font color=\"ba922d\">Тема 4: циклы While</font>\n",
    "\n",
    "## Объяснение:\n",
    "Функция While является циклической конструкцией в Python, которая выполняет определенный блок кода, пока условие истинно. Этот тип цикла особенно удобен, когда заранее неизвестно, сколько раз нужно выполнить определенные действия.\n",
    "\n",
    "## <font color=\"e85f35\">Шаблон кода на русском:</font>\n",
    "<pre>\n",
    "<font color=\"46e887\">while условие:\n",
    "    блок кода\n",
    "    выполняется, пока условие истинно</font></pre>\n",
    "\n",
    "\n",
    "## <font color=\"46d5e8\">Пример кода на языке Python:</font>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "while count < 5:\n",
    "    print(count)\n",
    "    count += 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Задания для закрепления:\n",
    "\n",
    "1. Напишите программу, используя цикл while, которая будет выводить на экран числа от 1 до 10.\n",
    "2. Напишите программу, используя цикл while, которая будет запрашивать у пользователя числа до тех пор, пока пользователь не введет число 0, после чего программа выведет сумму всех введенных чисел.\n",
    "3. Напишите программу, используя цикл while, которая будет проверять введенные пользователем пароли, пока он не введет правильный пароль \"python\", после чего программа выведет сообщение \"Доступ разрешен\".\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
